# **2988. Manager of the Largest Department**

**Table: Employees**
``` console
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| emp_id      | int     |
| emp_name    | varchar |
| dep_id      | int     |
| position    | varchar |
+-------------+---------+
```
emp_id is column of unique values for this table.

This table contains emp_id, emp_name, dep_id, and position.

Write a solution to find the name of the manager from the largest department. There may be multiple largest departments when the number of employees in those departments is the same.

Return the result table sorted by dep_id in ascending order.

The result format is in the following example.

 

**Example 1:**

**Input:** 
**Employees table:**
``` console
+--------+----------+--------+---------------+
| emp_id | emp_name | dep_id | position      | 
+--------+----------+--------+---------------+
| 156    | Michael  | 107    | Manager       |
| 112    | Lucas    | 107    | Consultant    |    
| 8      | Isabella | 101    | Manager       | 
| 160    | Joseph   | 100    | Manager       | 
| 80     | Aiden    | 100    | Engineer      | 
| 190    | Skylar   | 100    | Freelancer    | 
| 196    | Stella   | 101    | Coordinator   |
| 167    | Audrey   | 100    | Consultant    |
| 97     | Nathan   | 101    | Supervisor    |
| 128    | Ian      | 101    | Administrator |
| 81     | Ethan    | 107    | Administrator |
+--------+----------+--------+---------------+
```
**Output**
``` console
+--------------+--------+
| manager_name | dep_id | 
+--------------+--------+
| Joseph       | 100    | 
| Isabella     | 101    | 
+--------------+--------+
```
**Explanation**
- Departments with IDs 100 and 101 each has a total of 4 employees, while department 107 has 3 employees. Since both departments 100 and 101 have an equal number of employees, their respective managers will be included.
Output table is ordered by dep_id in ascending order.

**Solution-1:**

``` sql
# Write your MySQL query statement below

select emp_name as manager_name, dep_id
from employees
where position = 'Manager' 
and dep_id in (
select dep_id from employees 
group by dep_id 
having count(*) = (select count(*) as cnt
 from employees group by dep_id order by cnt desc limit 1) )
order by dep_id ASC

**Solution-2:**

``` sql
# Write your MySQL query statement below

WITH t AS (SELECT dep_id, RANK() OVER(ORDER BY COUNT(emp_id) DESC) AS rnk
FROM Employees
GROUP BY dep_id)

SELECT emp_name AS manager_name, dep_id
FROM Employees
WHERE position = "Manager" AND dep_id IN (SELECT dep_id
FROM t
WHERE rnk = 1)
ORDER BY dep_id